# Date & Time Analysis in SQL

## Introduction

Date and time analysis is a critical component of business intelligence and data analytics. Most real-world datasets include temporal information such as transaction dates, signup timestamps, or event logs.

SQL provides built-in date and time functions that allow analysts to filter, extract, group, and compare data across different time periods.

Time-based analysis is essential for identifying trends, measuring growth, evaluating performance, and conducting cohort or retention analysis.

This notebook focuses on practical date and time operations commonly used in industry-level analytics.

---

## Topics Covered

- Date and time data types
- Extracting year, month, and day
- Filtering by date ranges
- Time-based grouping (daily, monthly, yearly)
- Date arithmetic (adding and subtracting dates)
- Trend and period-over-period analysis

### Database Connection

In [1]:
%reload_ext sql
%config SqlMagic.style = '_DEPRECATED_DEFAULT'
%sql mysql+pymysql://root:Bhavesh%402025@localhost/customers

In [3]:
%%sql
select * from employees

 * mysql+pymysql://root:***@localhost/customers
8 rows affected.

[(1, 'Amit', 'IT', 'Data Analyst', 60000, datetime.date(2022, 1, 15), 'Mumbai'),
 (2, 'Neha', 'HR', 'HR Executive', 45000, datetime.date(2021, 7, 10), 'Pune'),
 (3, 'Rahul', 'IT', 'Data Scientist', 85000, datetime.date(2020, 3, 20), 'Bangalore'),
 (4, 'Priya', 'Finance', 'Accountant', 50000, datetime.date(2022, 11, 1), 'Delhi'),
 (5, 'Suresh', 'IT', 'Backend Engineer', 75000, datetime.date(2019, 6, 18), 'Hyderabad'),
 (6, 'Anita', 'Marketing', 'Marketing Manager', 55000, datetime.date(2021, 2, 25), 'Mumbai'),
 (7, 'Vikram', 'Finance', 'Financial Analyst', 65000, datetime.date(2020, 9, 12), 'Chennai'),
 (8, 'Rohit', 'Sales', 'Sales Executive', 48000, datetime.date(2023, 2, 5), 'Delhi')]

### Extracting Date Components

### Example 1: Extract Year

In [4]:
%%sql 
select name,joining_date,
year(joining_date)as joining_year
from employees

 * mysql+pymysql://root:***@localhost/customers
8 rows affected.

[('Amit', datetime.date(2022, 1, 15), 2022),
 ('Neha', datetime.date(2021, 7, 10), 2021),
 ('Rahul', datetime.date(2020, 3, 20), 2020),
 ('Priya', datetime.date(2022, 11, 1), 2022),
 ('Suresh', datetime.date(2019, 6, 18), 2019),
 ('Anita', datetime.date(2021, 2, 25), 2021),
 ('Vikram', datetime.date(2020, 9, 12), 2020),
 ('Rohit', datetime.date(2023, 2, 5), 2023)]

### Example 2: Extract Month

In [6]:
%%sql
select name,joining_date,
month(joining_date)as joining_month 
from employees

 * mysql+pymysql://root:***@localhost/customers
8 rows affected.

[('Amit', datetime.date(2022, 1, 15), 1),
 ('Neha', datetime.date(2021, 7, 10), 7),
 ('Rahul', datetime.date(2020, 3, 20), 3),
 ('Priya', datetime.date(2022, 11, 1), 11),
 ('Suresh', datetime.date(2019, 6, 18), 6),
 ('Anita', datetime.date(2021, 2, 25), 2),
 ('Vikram', datetime.date(2020, 9, 12), 9),
 ('Rohit', datetime.date(2023, 2, 5), 2)]

### Example 3: Extract Day

In [7]:
%%sql
select name,joining_date,
day(joining_date)as joining_day 
from employees

 * mysql+pymysql://root:***@localhost/customers
8 rows affected.

[('Amit', datetime.date(2022, 1, 15), 15),
 ('Neha', datetime.date(2021, 7, 10), 10),
 ('Rahul', datetime.date(2020, 3, 20), 20),
 ('Priya', datetime.date(2022, 11, 1), 1),
 ('Suresh', datetime.date(2019, 6, 18), 18),
 ('Anita', datetime.date(2021, 2, 25), 25),
 ('Vikram', datetime.date(2020, 9, 12), 12),
 ('Rohit', datetime.date(2023, 2, 5), 5)]

### Example 4: Extract Year & Month Together (Reporting Style)

In [11]:
%%sql
select name,DATE_FORMAT(joining_date,'%Y-%m')as year_month
from employees

 * mysql+pymysql://root:***@localhost/customers
(pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'year_month\nfrom employees' at line 1")
[SQL: select name,DATE_FORMAT(joining_date,'%%Y-%%m')as year_month
from employees]
(Background on this error at: https://sqlalche.me/e/20/f405)

### Filtering Using Dates

### Example 5: Employees Joined After 2021

In [12]:
%%sql 
select name, joining_date 
from employees where 
joining_date > '2021-12-31'

 * mysql+pymysql://root:***@localhost/customers
3 rows affected.

[('Amit', datetime.date(2022, 1, 15)),
 ('Priya', datetime.date(2022, 11, 1)),
 ('Rohit', datetime.date(2023, 2, 5))]

### Example 6: Employees Joined in 2022

In [14]:
%%sql
select name,joining_date 
from employees 
where year(joining_date)=2022

 * mysql+pymysql://root:***@localhost/customers
2 rows affected.

[('Amit', datetime.date(2022, 1, 15)), ('Priya', datetime.date(2022, 11, 1))]

### Example 7: Employees Joined in January

In [16]:
%%sql 
select name,joining_date
from employees 
where month(joining_date)=1

 * mysql+pymysql://root:***@localhost/customers
1 rows affected.

[('Amit', datetime.date(2022, 1, 15))]

### DATE_ADD() and DATE_SUB()

### Example 8: Joining Date + 1 Year

In [17]:
%%sql
select name,joining_date,
DATE_ADD(joining_date,INTERVAl 1 YEAR )as one_year_completion
from employees

 * mysql+pymysql://root:***@localhost/customers
8 rows affected.

[('Amit', datetime.date(2022, 1, 15), datetime.date(2023, 1, 15)),
 ('Neha', datetime.date(2021, 7, 10), datetime.date(2022, 7, 10)),
 ('Rahul', datetime.date(2020, 3, 20), datetime.date(2021, 3, 20)),
 ('Priya', datetime.date(2022, 11, 1), datetime.date(2023, 11, 1)),
 ('Suresh', datetime.date(2019, 6, 18), datetime.date(2020, 6, 18)),
 ('Anita', datetime.date(2021, 2, 25), datetime.date(2022, 2, 25)),
 ('Vikram', datetime.date(2020, 9, 12), datetime.date(2021, 9, 12)),
 ('Rohit', datetime.date(2023, 2, 5), datetime.date(2024, 2, 5))]

### Example 9: Joining Date - 30 Days

In [18]:
%%sql
select name,joining_date,
DATE_SUB(joining_date,INTERVAl 30 DAY)as one_year_completion
from employees

 * mysql+pymysql://root:***@localhost/customers
8 rows affected.

[('Amit', datetime.date(2022, 1, 15), datetime.date(2021, 12, 16)),
 ('Neha', datetime.date(2021, 7, 10), datetime.date(2021, 6, 10)),
 ('Rahul', datetime.date(2020, 3, 20), datetime.date(2020, 2, 19)),
 ('Priya', datetime.date(2022, 11, 1), datetime.date(2022, 10, 2)),
 ('Suresh', datetime.date(2019, 6, 18), datetime.date(2019, 5, 19)),
 ('Anita', datetime.date(2021, 2, 25), datetime.date(2021, 1, 26)),
 ('Vikram', datetime.date(2020, 9, 12), datetime.date(2020, 8, 13)),
 ('Rohit', datetime.date(2023, 2, 5), datetime.date(2023, 1, 6))]

### Example 10: Employees Completing 3 Years in 2023

In [22]:
%%sql
select name,joining_date
from employees
where DATE_ADD(joining_date,INTERVAL 3 YEAR) 
between '2023-01-01' AND '2023-12-31'

 * mysql+pymysql://root:***@localhost/customers
2 rows affected.

[('Rahul', datetime.date(2020, 3, 20)), ('Vikram', datetime.date(2020, 9, 12))]

### Time Difference Calculations

### Example 11: Tenure in Years

In [23]:
%%sql
select name,joining_date,
TIMESTAMPDIFF(YEAR,joining_date,CURDATE()) as tenure_years
from employees

 * mysql+pymysql://root:***@localhost/customers
8 rows affected.

[('Amit', datetime.date(2022, 1, 15), 4),
 ('Neha', datetime.date(2021, 7, 10), 4),
 ('Rahul', datetime.date(2020, 3, 20), 5),
 ('Priya', datetime.date(2022, 11, 1), 3),
 ('Suresh', datetime.date(2019, 6, 18), 6),
 ('Anita', datetime.date(2021, 2, 25), 4),
 ('Vikram', datetime.date(2020, 9, 12), 5),
 ('Rohit', datetime.date(2023, 2, 5), 3)]

### Example 12: Tenure in Months

In [25]:
%%sql
select name,
       TIMESTAMPDIFF(MONTH, joining_date, CURDATE()) AS tenure_months
from employees;

 * mysql+pymysql://root:***@localhost/customers
8 rows affected.

[('Amit', 49),
 ('Neha', 55),
 ('Rahul', 70),
 ('Priya', 39),
 ('Suresh', 79),
 ('Anita', 59),
 ('Vikram', 65),
 ('Rohit', 36)]

### Example 13: Days Since Joining

In [28]:
%%sql
select name,
DATEDIFF(CURDATE(), joining_date) AS days_worked
from employees

 * mysql+pymysql://root:***@localhost/customers
8 rows affected.

[('Amit', 1492),
 ('Neha', 1681),
 ('Rahul', 2158),
 ('Priya', 1202),
 ('Suresh', 2434),
 ('Anita', 1816),
 ('Vikram', 1982),
 ('Rohit', 1106)]

### Trend Analysis by Date
Very important for reporting.

In [29]:
%%sql
select YEAR(joining_date) as joining_year
,count(*) as employee_count
from employees 
group by YEAR(joining_date)
order by joining_year;

 * mysql+pymysql://root:***@localhost/customers
5 rows affected.

[(2019, 1), (2020, 2), (2021, 2), (2022, 2), (2023, 1)]

### Example 15: Employees Joined Per Month

In [30]:
%%sql
SELECT DATE_FORMAT(joining_date, '%Y-%m') AS year_month,
       COUNT(*) AS employee_count
FROM employees
GROUP BY year_month
ORDER BY year_month;

 * mysql+pymysql://root:***@localhost/customers
(pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'year_month,\n       COUNT(*) AS employee_count\nFROM employees\nGROUP BY year_month' at line 1")
[SQL: SELECT DATE_FORMAT(joining_date, '%%Y-%%m') AS year_month,
       COUNT(*) AS employee_count
FROM employees
GROUP BY year_month
ORDER BY year_month;]
(Background on this error at: https://sqlalche.me/e/20/f405)

### Example 16: Cumulative Hiring Trend

In [31]:
%%sql 
select joining_date,count(*)
Over(order by joining_date)as comulative_hires
from employees

 * mysql+pymysql://root:***@localhost/customers
8 rows affected.

[(datetime.date(2019, 6, 18), 1),
 (datetime.date(2020, 3, 20), 2),
 (datetime.date(2020, 9, 12), 3),
 (datetime.date(2021, 2, 25), 4),
 (datetime.date(2021, 7, 10), 5),
 (datetime.date(2022, 1, 15), 6),
 (datetime.date(2022, 11, 1), 7),
 (datetime.date(2023, 2, 5), 8)]

### Advanced Business-Level Queries

### Example 17: Average Salary by Joining Year

In [32]:
%%sql 
select YEAR(joining_date) as joining_year,
AVG(salary) from employees
group by YEAR(joining_date)
order by joining_year

 * mysql+pymysql://root:***@localhost/customers
5 rows affected.

[(2019, Decimal('75000.0000')),
 (2020, Decimal('75000.0000')),
 (2021, Decimal('50000.0000')),
 (2022, Decimal('55000.0000')),
 (2023, Decimal('48000.0000'))]

### Example 18: Top Salary Per Joining Year

In [34]:
%%sql
select *
from (
    select name,
           YEAR(joining_date) AS joining_year,
           salary,
           ROW_NUMBER() OVER (
               PARTITION BY YEAR(joining_date)
               ORDER BY salary DESC
           ) AS rank_num
    from employees
) ranked_data
where rank_num = 1;

 * mysql+pymysql://root:***@localhost/customers
5 rows affected.

[('Suresh', 2019, 75000, 1),
 ('Rahul', 2020, 85000, 1),
 ('Anita', 2021, 55000, 1),
 ('Amit', 2022, 60000, 1),
 ('Rohit', 2023, 48000, 1)]

### Example 19: Employees with Tenure Above Company Average Tenure

In [35]:
%%sql
SELECT name,
       TIMESTAMPDIFF(YEAR, joining_date, CURDATE()) AS tenure
FROM employees
WHERE TIMESTAMPDIFF(YEAR, joining_date, CURDATE()) >
(
    SELECT AVG(
        TIMESTAMPDIFF(YEAR, joining_date, CURDATE())
    )
    FROM employees
);

 * mysql+pymysql://root:***@localhost/customers
3 rows affected.

[('Rahul', 5), ('Suresh', 6), ('Vikram', 5)]